const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21',() => {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7',() => {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

//11 + 11 เท่ากับ 22
test('11 + 11 เท่ากับ 22', () => {
  expect(sum(11,11)).toBe(22);
});

//5 + 7 เท่ากับ 12
test('5 + 7 เท่ากับ 12', () => {
  expect(sum(5,7)).toBe(12);
});

//12 + 88 เท่ากับ 100
test('12 + 88 เท่ากับ 100', () => {
  expect(sum(12,88)).toBe(100)
})

